---
kind: property
id: P:Autodesk.Revit.DB.CylindricalHelix.YVector
source: html/6d243b0d-672a-dfeb-3ce0-8f74fd8fc21a.htm
---
# Autodesk.Revit.DB.CylindricalHelix.YVector Property

The Y direction vector.

## Syntax (C#)
```csharp
public XYZ YVector { get; }
```